//////////////////////////////////////////////////////////////////////////
//
// LOGOS: вывод в файл
//
//////////////////////////////////////////////////////////////////////////

Перем мФайлЛога;

Процедура ОткрытьФайл(Знач Путь, Знач Кодировка = "utf-8", Знач Добавлять = Истина) Экспорт
	//мФайлЛога = Новый ЗаписьТекста(Путь, Кодировка,,Добавлять);
КонецПроцедуры

Процедура Вывести(Знач Сообщение) Экспорт
	//ПроверитьИнициализацию();
	ФайлмФайлЛога = Новый ЗаписьТекста(мФайлЛога, "utf-8",,Истина);
	ФайлмФайлЛога.ЗаписатьСтроку(Сообщение);
	ФайлмФайлЛога.Закрыть();
КонецПроцедуры

Процедура Закрыть() Экспорт
	//ПроверитьИнициализацию();
	//мФайлЛога.Закрыть();
	мФайлЛога = Неопределено;
КонецПроцедуры

// Устанавливает свойство аппендера, заданное в конфигурационном файле
//
Процедура УстановитьСвойство(Знач ИмяСвойства, Знач Значение) Экспорт
	Если ИмяСвойства = "file" Тогда
		//ОткрытьФайл(Значение);
		мФайлЛога = Значение;
	КонецЕсли;
КонецПроцедуры // УстановитьСвойство()

Функция ПроверитьИнициализацию()
	Если мФайлЛога = Неопределено Тогда
		ВызватьИсключение "Не открыт файл лога";
	КонецЕсли;
КонецФункции
