
&НаКлиенте
Процедура ТестируемЛог1(Команда)
	ТестируемЛог1НаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестируемЛог1НаСервере()
	// Вставить содержимое обработчика.
	Лог = Логгер.МенеджерЛогов().ПолучитьЛог(Логгер.Лог1().Имя);
	Лог.Отладка("Начинаем отладку 1-ой кнопки  журналом №1");
	Лог.Информация("Информируем, что идёт отладка 1-ой кнопки  журналом №1");
	Лог.Отладка("Конец отладки 1-ой кнопки  журналом №1");
КонецПроцедуры

&НаКлиенте
Процедура ТестируемЛог2(Команда)
	ТестируемЛог2НаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестируемЛог2НаСервере()
	// Вставить содержимое обработчика.
	Лог = Логгер.МенеджерЛогов().ПолучитьЛог(Логгер.Лог2().Имя);
	Лог.Отладка("Начинаем отладку 2-ой кнопки  журналом №2");
	Лог.Информация("Информируем, что идёт отладка 2-ой кнопки  журналом №2");
	Лог.Отладка("Конец отладки 2-ой кнопки  журналом №2");

КонецПроцедуры

&НаКлиенте
Процедура ТестируемПроизвольныйЛог(Команда)
	// Вставить содержимое обработчика.
	
	ТестируемПроизвольныйЛогНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТестируемПроизвольныйЛогНаСервере()
	// Вставить содержимое обработчика.
	Лог = Логгер.МенеджерЛогов().ПолучитьЛог(ИмяЛога);
	Лог.Отладка("Начинаем отладку произвольного лога " + ИмяЛога);
	Лог.Информация("Информируем, что идёт отладка произвольного лога " + ИмяЛога);
	Лог.Отладка("Конец отладки произвольного лога " + ИмяЛога);

КонецПроцедуры

&НаКлиенте
Процедура ТестируемЛо1аПотом2Лог2(Команда)
	ТестируемЛо1аПотом2Лог2НаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестируемЛо1аПотом2Лог2НаСервере()
	// Вставить содержимое обработчика.
	Логгер.МенеджерЛогов().ИспользоватьУровниВложенностиВызовов(Истина);
	
	Логгер.МенеджерЛогов().УстановитьТекущийУровеньВложенностиВызовов(0);

	ТестируемЛог1НаСервере();	
	
	Логгер.МенеджерЛогов().УстановитьСледующийУровеньВложенностиВызовов();
	
	ТестируемЛог2НаСервере();	
	
	Логгер.МенеджерЛогов().УстановитьПредыдущийУровеньВложенностиВызовов();
	
	ТестируемЛог1НаСервере();	
	
	Логгер.МенеджерЛогов().ИспользоватьУровниВложенностиВызовов(Ложь);
	
КонецПроцедуры


