Функция СписокЖурналовЛогов() Экспорт
	
	спз = Новый СписокЗначений;
	
	спз.Добавить(Лог_rootLogger().ИмяЛога, Лог_rootLogger().Описание);
	
	спз.Добавить(Лог1().Имя, Лог1().Описание);
	
	спз.Добавить(Лог2().Имя, Лог2().Описание);
	
	Возврат спз;	
	
	
КонецФункции

Функция Лог_rootLogger() Экспорт
	
	Возврат Новый Структура("ИмяЛога,Описание", "rootLogger", "rootLogger - корневой журнал");
	
КонецФункции

Функция Лог1() Экспорт 
	
	Возврат Новый Структура("Имя,Описание", "Log1", "Log1 - здесь 1-ый алгоритм логируем");
	
КонецФункции	

Функция Лог2() Экспорт 
	
	Возврат Новый Структура("Имя,Описание", "Log2", "Log2 - здесь 2-ой алгоритм логируем");
	
КонецФункции	

Функция МенеджерЛогов() Экспорт
	Возврат Обработки.МенеджерЛогированияЛог.Создать();
КонецФункции	
